/****************************************************************
// rtos.h
//
// Created: 11/02/2015 1:54:37 PM
//  Author: Alex
//
****************************************************************/
#ifndef RTOS_H_
#define RTOS_H_   
#include <project.h>
    
/*============================================================================
Defines, Macros
============================================================================*/
#define MAXnTASKS      5u               // Количество задач

/*============================================================================
Typedefs
============================================================================*/
//typedef struct _task
//{   
//   void (*pFunc) (void);               // указатель на функцию
//   uint16_t delay;                     // задержка перед первым запуском задачи
//   uint16_t period;                    // период запуска задачи
//   uint8_t run;                        // флаг готовности задачи к запуску
//}task;

/*============================================================================
Global functions
============================================================================*/
void Shed_Init (void);
void Shed_SetTask (void (*taskFunc)(void), uint16_t taskDelay, uint16_t taskPeriod);
void Shed_DeleteTask (void (*taskFunc)(void));
void Shed_DispatchTask (void);
CY_INLINE void Shed_Tick(void);


///*=============================================================================
// Тело планировщика. Вызываем в прерываниях каждую ms
// Встраиваемая функция
//=============================================================================*/
//static CY_INLINE void Shed_Tick()
//{
//  uint8_t i;
//    
//  for (i = 0u; i<TaskArrTail; i++)    // проходим по списку задач
//  {
//    if  (TaskArray[i].delay == 0u)    // если время до выполнения истекло
//    {    
//      TaskArray[i].run = 1u;          // взводим флаг запуска,
//    }
//    else
//    {
//      TaskArray[i].delay--;             // иначе уменьшаем время
//    }
//  }   
//}

#endif /* RTOS_H_ */
/*============================================================================
  END OF FILE 
============================================================================*/